In [35]:
from numpy.random import *
from pandas import *

In [93]:
df = DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [94]:
df

          W         X         Y         Z
A -0.704977  0.274610 -1.327545 -0.504195
B  2.328509 -1.598924 -0.502596  0.661291
C  1.000506  2.464622  0.140863 -0.790580
D -1.707274 -0.093257  0.986152  0.903222
E -1.335283 -1.691982 -1.315044 -0.219159

In [95]:
bool_check = df > 0

In [96]:
df[bool_check]

          W         X         Y         Z
A       NaN  0.274610       NaN       NaN
B  2.328509       NaN       NaN  0.661291
C  1.000506  2.464622  0.140863       NaN
D       NaN       NaN  0.986152  0.903222
E       NaN       NaN       NaN       NaN

In [97]:
df[df>0]

          W         X         Y         Z
A       NaN  0.274610       NaN       NaN
B  2.328509       NaN       NaN  0.661291
C  1.000506  2.464622  0.140863       NaN
D       NaN       NaN  0.986152  0.903222
E       NaN       NaN       NaN       NaN

In [98]:
df['W']>0

A    False
B     True
C     True
D    False
E    False
Name: W, dtype: bool

In [99]:
df[df['W']> 0]

          W         X         Y         Z
B  2.328509 -1.598924 -0.502596  0.661291
C  1.000506  2.464622  0.140863 -0.790580

In [100]:
df[df['W']>0]['X']

B   -1.598924
C    2.464622
Name: X, dtype: float64

In [101]:
df[df['W']>0][['X','Y']]

          X         Y
B -1.598924 -0.502596
C  2.464622  0.140863

In [102]:
df[(df['X']>0) & (df['Y']>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [103]:
df[(df['X']>0) | (df['Y']>1)]

          W         X         Y         Z
A -0.704977  0.274610 -1.327545 -0.504195
C  1.000506  2.464622  0.140863 -0.790580

In [104]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.704977  0.274610 -1.327545 -0.504195
1     B  2.328509 -1.598924 -0.502596  0.661291
2     C  1.000506  2.464622  0.140863 -0.790580
3     D -1.707274 -0.093257  0.986152  0.903222
4     E -1.335283 -1.691982 -1.315044 -0.219159

In [105]:
newInd = 'MALIK ALI NAWAB KHAN BANGASH'.split()

In [106]:
df['state'] = newInd

In [107]:
df

          W         X         Y         Z    state
A -0.704977  0.274610 -1.327545 -0.504195    MALIK
B  2.328509 -1.598924 -0.502596  0.661291      ALI
C  1.000506  2.464622  0.140863 -0.790580    NAWAB
D -1.707274 -0.093257  0.986152  0.903222     KHAN
E -1.335283 -1.691982 -1.315044 -0.219159  BANGASH

In [108]:
df.set_index('state')

                W         X         Y         Z
state
MALIK   -0.704977  0.274610 -1.327545 -0.504195
ALI      2.328509 -1.598924 -0.502596  0.661291
NAWAB    1.000506  2.464622  0.140863 -0.790580
KHAN    -1.707274 -0.093257  0.986152  0.903222
BANGASH -1.335283 -1.691982 -1.315044 -0.219159